app/controllers/admin_controller.rb

SELECT "bars".* FROM "bars"
---
  def index
    safe do
      @bars = Bar.all

SELECT  "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def view
    safe do
      @bar = Bar.find(bar_id)

DELETE FROM "bars" WHERE "bars"."id" = ?  [["id", 1]]
SELECT  "bars".* FROM "bars" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def delete
    safe do
      Bar.find_by(bar_id).destroy

SELECT  "bars".* FROM "bars" WHERE (2) LIMIT ?  [["LIMIT", 1]]
---
  def update
    safe do
      @bar = Bar.find_by bar_id

SELECT  "bars".* FROM "bars" WHERE (2) LIMIT ?  [["LIMIT", 1]]
UPDATE "bars" SET "name" = ?, "updated_at" = ? WHERE "bars"."id" = ?  [["name", "fuck the people who consent to sex"], ["updated_at", 2016-11-19 22:36:27 UTC], ["id", 2]]
---
  def save
    safe do
      bar = Bar.find_by bar_id
      bar.attributes = bar_item
      bar.save

INSERT INTO "bars" ("name", "latitude", "longitude", "description", "rating", "loudness", "crowdedness", "bar_category", "address", "person_count", "rating_count", "loudness_count", "crowdedness_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def add
    safe do
      print params
      Bar.create bar_item