app/controllers/bar_controller.rb

  def index
    begin
      latitude = latitude_and_longitude[0].to_d
      longitude = latitude_and_longitude[1].to_d

      bars = Bar.where(
      "latitude >= :latitudeLow AND latitude <= :latitudeHigh AND longitude >= :longitudeLow AND longitude <= :longitudeHigh",
      {latitudeLow: latitude - 0.0072, latitudeHigh: latitude + 0.0072, longitudeLow: longitude - 0.0072, longitudeHigh: longitude + 0.0072}

      )
---
SELECT "bars".* FROM "bars" WHERE "bars"."latitude" IN (-1.0, 1.0) AND "bars"."longitude" IN (-1.0, 1.0)